In [2]:
import pandas as pd
from sqlalchemy import create_engine

### Store csv into DF

In [67]:
csv_file = "Resources/Players.csv"
nba_players_df = pd.read_csv(csv_file, index_col=0)
nba_players_df.head()
#nba_players_df.shape

,Player,height,weight,collage,born,birth_city,birth_state
0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

### Create new data with select columns

In [68]:
nba_new_df = nba_players_df[["Player", "collage", "born", "birth_city", "birth_state"]]
nba_new_df.head()
#nba_new_df.shape

,Player,collage,born,birth_city,birth_state
0,Curly Armstrong,Indiana University,1918.0,NaN,NaN
1,Cliff Barker,University of Kentucky,1921.0,Yorktown,Indiana
2,Leo Barnhorst,University of Notre Dame,1924.0,NaN,NaN
3,Ed Bartels,North Carolina State University,1925.0,NaN,NaN
4,Ralph Beard,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [45]:
nba_new_df = nba_new_df.dropna()
nba_new_df.head()
nba_new_df.loc[nba_new_df["Player"] == "Russell Westbrook"]

,Player,collage,born,birth_city,birth_state
3325,Russell Westbrook,"University of California, Los Angeles",1988.0,Long Beach,California

## Second CSV import to pandas

In [38]:
csv_file = "Resources/nba_2017_twitter_players.csv"
nba_twitter_df = pd.read_csv(csv_file)
nba_twitter_df.head(20)

                PLAYER  TWITTER_FAVORITE_COUNT  TWITTER_RETWEET_COUNT
0    Russell Westbrook                  2130.5                  559.0
1         James Harden                   969.0                  321.5
2        Isaiah Thomas                   467.5                  155.5
3        Anthony Davis                   368.0                  104.0
4        DeMar DeRozan                     0.0                  186.0
5     DeMarcus Cousins                   102.0                   91.5
6       Damian Lillard                   186.5                   43.0
7         LeBron James                  5533.5                 1501.5
8        Kawhi Leonard                  2701.5                  716.5
9        Stephen Curry                 12278.0                 2893.0
10        Kyrie Irving                  1541.0                  695.0
11        Kevin Durant                  1425.5                  366.0
12  Karl-Anthony Towns                     0.0                  105.0
13        Jimmy Butler                    89.5                   30.0
14         Paul George                   228.5                  128.0
15      Andrew Wiggins                   182.0                   54.5
16        Kemba Walker                    59.5                   32.5
17        Bradley Beal                    55.5                   40.5
18           John Wall                     0.0                   77.0
19       C.J. McCollum                   126.0                   33.0

In [36]:
nba_twitter_df.columns = ["Player","Twitter_Favorite_Count", "Twitter_Retweet_Count"]
nba_twitter_df.head()
nba_twitter_df.shape

(329, 3)

## Third CSV import to pandas

In [33]:
# csv_file = "Resources/nba_2017_salary.csv"
# nba_salary_df = pd.read_csv(csv_file)
# nba_salary_df.head()
# nba_salary_df.shape

(449, 4)

In [60]:
#nba_salary_df.columns

Index(['Player', 'Position', 'Team', 'Salary'], dtype='object')

In [59]:
#nba_salary_df.columns = ["Player","Position", "Team", "Salary"]

In [58]:
# nba_salary_df.head()
# nba_salary_df.loc[nba_salary_df["Player"] == "Russell Westbrook"]

                Player Position                   Team      Salary
448  Russell Westbrook       PG  Oklahoma City Thunder  26500000.0

## 1st merge

In [62]:
t1_nba_df = pd.merge(nba_new_df, nba_twitter_df, on="Player")
t1_nba_df.head()
#t1_nba_df.shape

KeyError: 'Player'

## 2nd merge

In [31]:
final_nba_df = pd.merge(t1_nba_df, nba_salary_df, on="Player")
final_nba_df.shape

(3, 10)

In [37]:
# final_nba_df.head()

,Player,collage,born,birth_city,birth_state,Twitter_Favorite_Count,Twitter_Retweet_Count,Position,Team,Salary
0,Gerald Henderson,Virginia Commonwealth University,1956.0,Richmond,Virginia,1.0,8.0,SG,Philadelphia 76ers,9000000.0
1,Reggie Williams,Georgetown University,1964.0,Baltimore,Maryland,0.0,0.0,SF,New Orleans Pelicans,895197.0
2,Vince Carter,University of North Carolina,1977.0,Daytona Beach,Florida,0.0,7.0,SG,Memphis Grizzlies,4264057.0

## Create engine

In [ ]:
from config import postgres_credentials as creds
rds_connection_string = f"{creds['user']}:{creds['pass']}@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')